{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (custom category deletion, emoji auto-suggest, logo consistency, password hints) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document providing one-sentence summaries of every frontend source file, serving as a build/documentation reference for the project's frontend structure.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based design tokens for light and dark themes, including colors for background, primary, sidebar, charts, and border variables.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the favicon, page title 'Task Queue — Your Productivity Hub', and loading DM Sans from Google Fonts.",
  "frontend/src/App.tsx": "Root React component managing view state between login, signup, and dashboard, persisting session on mount and rendering a Sonner Toaster for notifications.",
  "frontend/src/components/CustomPopup.tsx": "Reusable modal popup component supporting error, info, and confirm dialog types with Escape key dismissal, backdrop click, and animated scale-in styling.",
  "frontend/src/components/DashboardHeader.tsx": "Sticky top navigation header displaying the Task Queue logo image, a search bar with clear button, a Gmail-style user avatar, and a logout button.",
  "frontend/src/components/Sidebar.tsx": "Renders a sidebar with category navigation, supporting adding new categories with keyword-based emoji suggestions and deleting existing ones.",
  "frontend/src/components/TaskCard.tsx": "Displays a single task card with title, description, status/priority badges, due date, and edit/delete actions, with search query highlighting support.",
  "frontend/src/components/TaskList.tsx": "Renders a responsive grid of TaskCard components or a contextual empty state message based on active tab, category, or search query.",
  "frontend/src/components/TaskModal.tsx": "Modal form for creating or editing a task, with fields for title, description, category, status, due date, and priority.",
  "frontend/src/components/VerificationModal.tsx": "Modal that prompts the user to enter a 6-digit email verification code, displaying the code on-screen in demo mode and marking the user as verified on success.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an Internet Computer actor (authenticated or anonymous) based on the current identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login, logout, and identity persistence via AuthClient.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS with custom CSS variables for light/dark themes and keyframe animations for slide, scale, and card reveal effects.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page component that manages tasks and categories for a logged-in user, supporting filtering by tab/category/search and CRUD operations.",
  "frontend/src/pages/Login.tsx": "Login page component with email/phone and password fields that authenticates users and shows error popups on failure.",
  "frontend/src/pages/Signup.tsx": "Signup page component that collects user details, validates input, triggers account creation, and shows an email verification modal on success.",
  "frontend/src/utils/auth.ts": "Authentication utility providing login, signup, and logout functions with validation logic, session management, and email verification code generation.",
  "frontend/src/utils/avatar.ts": "Utility functions that derive a deterministic avatar background color and initial letter from a user's name.",
  "frontend/src/utils/notifications.ts": "Thin wrapper around the Sonner toast library that exposes a unified showNotification function supporting success, info, and warning types.",
  "frontend/src/utils/storage.ts": "Defines TypeScript interfaces (User, Task, CategoryEntry) and localStorage CRUD helpers for users, sessions, tasks, and per-user categories, including default category presets and backward-compatibility handling.",
  "frontend/src/utils/validation.ts": "Provides utility functions for validating email and phone formats, plus a highlightText helper that wraps query matches in styled <mark> tags.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom navy/sky/surface color palettes using oklch, DM Sans font, custom border radii, box shadows, and accordion keyframe animations.",
  "project_state.json": "Tracks the overall project state (version 15) for the Task Queue React/TypeScript app, documenting architectural decisions, existing features, known issues, and design/tech constraints."
}